; domain
(define (domain blocksworld-domain)
 (:requirements :strips :typing :constraints :action-costs)
 (:types block)
 (:predicates (clear ?obj - block) (ontable ?obj - block) (handempty) (holding ?obj - block) (on ?obj1 - block ?obj2 - block))
 (:functions (total-cost))
 (:action pickup
  :parameters ( ?obj - block)
  :precondition (and (clear ?obj) (ontable ?obj) (handempty))
  :effect (and (holding ?obj) (not (clear ?obj)) (not (ontable ?obj)) (not (handempty)) (increase (total-cost) 1)))
 (:action putdown
  :parameters ( ?obj - block)
  :precondition (and (holding ?obj))
  :effect (and (clear ?obj) (handempty) (ontable ?obj) (not (holding ?obj)) (increase (total-cost) 1)))
 (:action stack
  :parameters ( ?obj - block ?underobj - block)
  :precondition (and (clear ?underobj) (holding ?obj))
  :effect (and (handempty) (clear ?obj) (on ?obj ?underobj) (not (clear ?underobj)) (not (holding ?obj)) (increase (total-cost) 1)))
 (:action unstack
  :parameters ( ?obj - block ?underobj - block)
  :precondition (and (on ?obj ?underobj) (clear ?obj) (handempty))
  :effect (and (holding ?obj) (clear ?underobj) (not (on ?obj ?underobj)) (not (clear ?obj)) (not (handempty)) (increase (total-cost) 1)))
)

; problem
(define (problem blocksworld-problem)
 (:domain blocksworld-domain)
 (:objects
   yellow_block_1 brown_block_1 brown_block_2 purple_block_1 black_block_1 orange_block_1 green_block_1 - block
 )
 (:init (ontable yellow_block_1) (ontable brown_block_1) (on brown_block_2 yellow_block_1) (on purple_block_1 brown_block_1) (on black_block_1 purple_block_1) (ontable orange_block_1) (on green_block_1 black_block_1) (clear brown_block_2) (clear orange_block_1) (clear green_block_1) (handempty) (= (total-cost) 0))
 (:goal (and (on brown_block_1 orange_block_1)))
 (:constraints (sometime (and (holding brown_block_2) (on orange_block_1 brown_block_1))))
 (:metric minimize (total-cost))
)

; plan
1. (unstack green_block_1 black_block_1)
   deleted: (on green_block_1 black_block_1) (clear green_block_1) (handempty)
   added: (holding green_block_1) (clear black_block_1)
   goals met: 0 of 1
2. (putdown green_block_1)
   deleted: (holding green_block_1)
   added: (clear green_block_1) (handempty) (ontable green_block_1)
   goals met: 0 of 1
3. (unstack black_block_1 purple_block_1)
   deleted: (on black_block_1 purple_block_1) (clear black_block_1) (handempty)
   added: (holding black_block_1) (clear purple_block_1)
   goals met: 0 of 1
4. (putdown black_block_1)
   deleted: (holding black_block_1)
   added: (clear black_block_1) (handempty) (ontable black_block_1)
   goals met: 0 of 1
5. (unstack purple_block_1 brown_block_1)
   deleted: (on purple_block_1 brown_block_1) (clear purple_block_1) (handempty)
   added: (holding purple_block_1) (clear brown_block_1)
   goals met: 0 of 1
6. (putdown purple_block_1)
   deleted: (holding purple_block_1)
   added: (clear purple_block_1) (handempty) (ontable purple_block_1)
   goals met: 0 of 1
7. (pickup orange_block_1)
   deleted: (clear orange_block_1) (ontable orange_block_1) (handempty)
   added: (holding orange_block_1)
   goals met: 0 of 1
8. (stack orange_block_1 brown_block_1)
   deleted: (clear brown_block_1) (holding orange_block_1)
   added: (handempty) (clear orange_block_1) (on orange_block_1 brown_block_1)
   goals met: 0 of 1
9. (unstack brown_block_2 yellow_block_1)
   deleted: (on brown_block_2 yellow_block_1) (clear brown_block_2) (handempty)
   added: (holding brown_block_2) (clear yellow_block_1)
   goals met: 0 of 1
10. (putdown brown_block_2)
   deleted: (holding brown_block_2)
   added: (clear brown_block_2) (handempty) (ontable brown_block_2)
   goals met: 0 of 1
11. (unstack orange_block_1 brown_block_1)
   deleted: (on orange_block_1 brown_block_1) (clear orange_block_1) (handempty)
   added: (holding orange_block_1) (clear brown_block_1)
   goals met: 0 of 1
12. (putdown orange_block_1)
   deleted: (holding orange_block_1)
   added: (clear orange_block_1) (handempty) (ontable orange_block_1)
   goals met: 0 of 1
13. (pickup brown_block_1)
   deleted: (clear brown_block_1) (ontable brown_block_1) (handempty)
   added: (holding brown_block_1)
   goals met: 0 of 1
14. (stack brown_block_1 orange_block_1)
   deleted: (clear orange_block_1) (holding brown_block_1)
   added: (handempty) (clear brown_block_1) (on brown_block_1 orange_block_1)
   goals met: 1 of 1
